// List of shops

const whereBuyAddresses = {
    "areas": [
        {
            "area_name": "Ростовская обл.",
            "area_pointer": "47.22919600, 39.71336962",
            "area_zoom": "9",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Доватора, д. 158",
                            "shop_pointer": "47.239217, 39.584712"
                        },
                        {
                            "shop_address": "г. Аксай, Аксайский пр-кт, д. 23 (ТРЦ Мега-Ростов)",
                            "shop_pointer": "47.290051, 39.846535"
                        },
                        {
                            "shop_address": "п. Верхнетемерницкий, ул. Обсерваторная, д. 15",
                            "shop_pointer": "47.309453, 39.726700"
                        }
                    ]
                },
                {
                    "shop_name": "ООО «ВАШ ДОМ»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Ростов-на-Дону, пр. 40 Летия Победы, д. 270",
                            "shop_pointer": "47.237266, 39.820673"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Каскадная, д. 72",
                            "shop_pointer": "47.298766, 39.783914"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, пр-т. Королева, д. 30а",
                            "shop_pointer": "47.296249, 39.721040"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Малиновского, д. 48а",
                            "shop_pointer": "47.217225, 39.614222"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Нансена, д. 152а",
                            "shop_pointer": "47.243567, 39.727086"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Портовая, д. 70",
                            "shop_pointer": "47.209108, 39.690246"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Портовая, д. 532",
                            "shop_pointer": "47.191243, 39.626816"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, пер. Сальский, 28 А",
                            "shop_pointer": "47.276585, 39.749634"
                        },
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Таганрогское шоссе, д. 175 Г",
                            "shop_pointer": "47.257603, 39.640402"
                        },
                        {
                            "shop_address": "г. Аксай, ул. Вартанова, д.11",
                            "shop_pointer": "47.276660, 39.873298"
                        },
                        {
                            "shop_address": "г. Батайск, ул. Максима Горького, д. 285 корпус Л",
                            "shop_pointer": "47.137770, 39.716172"
                        },
                        {
                            "shop_address": "г. Батайск, ул. Ленина, д. 168 корпус А",
                            "shop_pointer": "47.115496, 39.747083"
                        },
                        {
                            "shop_address": "г. Батайск, ул. Шмидта, д. 17",
                            "shop_pointer": "47.133650, 39.767915"
                        }
                    ],
                    "shop_phone": [
                        "8 (863) 310-000-3"
                    ],
                    "shop_site": "https://vashdom24.ru/"
                },
                {
                    "shop_name": "ООО «Газобетон-Югстрой»",
                    "shop_description": "Оптово-розничный склад",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Малиновского, д. 77",
                            "shop_pointer": "47.257898, 39.617438",
                            "phone_for_one_shop": "8 (989) 516-20-62"
                        },
                        {
                            "shop_address": "г. Аксай, ул. Объездная, д. 10",
                            "shop_pointer": "47.277838, 39.871589",
                            "phone_for_one_shop": "8 (905) 458-53-43"
                        },
                        {
                            "shop_address": "г. Аксай, ул. Шолохова, д. 1",
                            "shop_pointer": "47.273302, 39.854620",
                            "phone_for_one_shop": "8 (918) 555-86-44"
                        },
                        {
                            "shop_address": "г. Батайск, ул. Фермерская, д. 21",
                            "shop_pointer": "47.142062, 39.708176",
                            "phone_for_one_shop": "8 (989) 516-19-81"
                        },
                        {
                            "shop_address": "г. Новочеркасск, Новочеркасское шоссе, д. 1В",
                            "shop_pointer": "47.420111, 40.019181",
                            "phone_for_one_shop": "8 (989) 516-20-05"
                        },
                        {
                            "shop_address": "г. Новочеркасск, Харьковское шоссе, д. 32",
                            "shop_pointer": "47.481431, 40.103471",
                            "phone_for_one_shop": "8 (918) 520-23-06"
                        }
                    ]
                },
                {
                    "shop_name": "ИП Бочоришвили Давид Хутаевич",
                    "shop_description": "Оптово-розничный склад",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Механизаторов, д. 7",
                            "shop_pointer": "47.271290, 39.773098"
                        }
                    ],
                    "shop_phone": [
                        "8 (928) 229-52-09"
                    ]
                },
                {
                    "shop_name": "ИП Сибиль Павел Юрьевич",
                    "shop_description": "Оптово-розничный склад",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Ростов-на-Дону, ул. Текучева, д. 372",
                            "shop_pointer": "47.241664, 39.743768"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Краснодарский край",
            "area_pointer": "45.48040495, 38.85300280",
            "area_zoom": "7",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Краснодар, ул. им. Александра Покрышкина, д. 5",
                            "shop_pointer": "45.107419, 38.952011"
                        },
                        {
                            "shop_address": "г. Краснодар, ул. Новороссийская, д. 234/1",
                            "shop_pointer": "45.037152, 39.053592"
                        },
                        {
                            "shop_address": "аул Новая Адыгея, Тургеневское шоссе, д. 27 А",
                            "shop_pointer": "45.013084, 38.929328"
                        },
                        {
                            "shop_address": "г. Новороссийск, ул. Ленина, д. 7 К",
                            "shop_pointer": "44.748057, 37.730221"
                        }
                    ]
                },
                {
                    "shop_name": "ИП Хомутов Андрей Васильевич",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Краснодар, ул. Уральская, 144",
                            "shop_pointer": "45.037018, 39.083794"
                        },
                        {
                            "shop_address": "г. Краснодар, ул. Просторная, 13/2",
                            "shop_pointer": "45.035547, 39.084467"
                        }
                    ],
                    "shop_phone": [
                        "8 (928) 429-43-84"
                    ]
                },
                {
                    "shop_name": "ООО «Артель»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Краcнодар, ул. Аэропортовская, д. 2/3",
                            "shop_pointer": "45.022819, 39.126760"
                        }
                    ],
                    "shop_phone": [
                        "8 (918) 440-05-37"
                    ],
                    "shop_email": "artel_ps@mail.ru"
                },
                {
                    "shop_name": "ООО «Стройресурс»",
                    "shop_addresses": [
                        {
                            "shop_address": "Краснодарский край, г. Ейск, ул. Б.Хмельницкого, 137/1",
                            "shop_pointer": "46.686147, 38.270576"
                        }
                    ],
                    "shop_phone": [
                        "8 (86132) 2-81-92",
                        "8 (86132) 2-82-19",
                        "8 (86132) 2-81-71"
                    ]
                },
                {
                    "shop_name": "ИП Чулкин Александр Валерьевич",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Краснодар, ул. Большевистская, 293/1",
                            "shop_pointer": "45.126119, 38.995471"
                        }
                    ],
                    "shop_phone": [
                        "8 (861) 225-93-73",
                        "8 (988) 240-40-08"
                    ]
                }
            ]
        },
        {
            "area_name": "Белгородская область",
            "area_pointer": "50.597969, 36.586419",
            "area_zoom": "11",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "п. Дубовое, мкр. Пригородный, ул. Щорса, з/у 64 Б",
                            "shop_pointer": "50.552939, 36.560573"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Волгоградская область",
            "area_pointer": "48.724770, 44.544062",
            "area_zoom": "10",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Волгоград, Университетский пр-кт, д. 107 (ТРЦ Акварель)",
                            "shop_pointer": "48.636558, 44.436073"
                        },
                        {
                            "shop_address": "г. Волжский, пр-кт им. Ленина, д. 2 Ж",
                            "shop_pointer": "48.813330, 44.726283"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Воронежская область",
            "area_pointer": "51.682470, 39.185513",
            "area_zoom": "10",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Воронеж, ул. Парковая, д. 5",
                            "shop_pointer": "51.786332, 39.200952"
                        },
                        {
                            "shop_address": "п. Отрадное, ул. Автодорожная, д. 11",
                            "shop_pointer": "51.650045, 39.309360"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Курская область",
            "area_pointer": "51.731040, 36.179922",
            "area_zoom": "11",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Курск, ул. Энгельса, д. 115Д/1",
                            "shop_pointer": "51.698136, 36.156125"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Республика Северная Осетия",
            "area_pointer": "43.041732, 44.671774",
            "area_zoom": "11",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "г. Владикавказ, Архонское шоссе, д. 1А",
                            "shop_pointer": "43.057279, 44.638850"
                        }
                    ]
                }
            ]
        },
        {
            "area_name": "Ставропольский край",
            "area_pointer": "45.04354336, 41.96781694",
            "area_zoom": "11",
            "area_shop": [
                {
                    "shop_name": "ООО «Леруа Мерлен Восток»",
                    "shop_addresses": [
                        {
                            "shop_address": "с. Татарка, Южный обход, д. 1",
                            "shop_pointer": "44.984835, 41.968519"
                        }
                    ]
                }
            ]
        }
    ]
};
